layui.define(function(exports){
	
	var face={};
	
	face.code_sc=["[微笑]", "[嘻嘻]", "[哈哈]", "[可爱]", "[可怜]", "[挖鼻]", "[吃惊]", "[害羞]", "[挤眼]", "[闭嘴]",
	              "[鄙视]", "[爱你]", "[泪]", "[偷笑]", "[亲亲]", "[生病]", "[太开心]", "[白眼]", "[右哼哼]", "[左哼哼]",
	              "[嘘]", "[衰]", "[委屈]", "[吐]", "[哈欠]", "[抱抱]", "[怒]", "[疑问]", "[馋嘴]", "[拜拜]", "[思考]",
	              "[汗]", "[困]", "[睡]", "[钱]", "[失望]", "[酷]", "[色]", "[哼]", "[鼓掌]", "[晕]", "[悲伤]", "[抓狂]", 
	              "[黑线]", "[阴险]", "[怒骂]", "[互粉]", "[心]", "[伤心]", "[猪头]", "[熊猫]", "[兔子]", "[ok]", "[耶]",
	              "[good]", "[NO]", "[赞]", "[来]", "[弱]", "[草泥马]", "[神马]", "[囧]", "[浮云]", "[给力]", "[围观]", 
	              "[威武]", "[奥特曼]", "[礼物]", "[钟]", "[话筒]", "[蜡烛]", "[蛋糕]"];
	
	face.code_en=["[Smile]", "[Grin]", "[Laugh]", "[Joyful]", "[Whimper]", "[Nose Pick]", "[Surprise]", "[Shy]", "[Wink]",
	              "[Silent]", "[LookDown]", "[Love]", "[Sob]", "[Chuckle]", "[Liss]", "[Sick]", "[Happy]", "[Slight]", 
	              "[RightHem]", "[LeftHem]", "[Hush]", "[Toasted]", "[Wronged]", "[Puke]", "[Yawn]", "[Hug]", "[Pout]", 
	              "[Doubt]", "[Greedy]", "[Wave]", "[Thinking]", "[Sweat]", "[Drowsy]", "[Sleep]", "[Money]", "[Despair]", 
	              "[Cool]", "[Drool]", "[Hum]", "[Clap]", "[Dizzy]", "[Sad]", "[Crazy]", "[Speechless]", "[Sly]", "[Scold]",
	              "[FansEachOther]", "[Heart]", "[HeartBroken]", "[Pig]", "[Panda]", "[Rabbit]", "[Ok]", "[Yeah]", "[Good]",
	              "[NO]", "[Strong]", "[Beckon]", "[Weak]", "[Fuck you]", "[What]", "[Embarrassed]", "[Cloud]", "[Gelivable]",
	              "[Onlookers]", "[Mighty]", "[Altman]", "[Gift]", "[Clock]", "[Microphone]", "[Candle]", "[Cake]"];
	
	face.code_tc=["[微笑]", "[嘻嘻]", "[哈哈]", "[可愛]", "[可憐]", "[挖鼻]", "[吃驚]", "[害羞]", "[擠眼]", "[閉嘴]",
	              "[鄙視]", "[愛妳]", "[淚]", "[偷笑]", "[親親]", "[生病]", "[太開心]", "[白眼]", "[右哼哼]", "[左哼哼]",
	              "[噓]", "[衰]", "[委屈]", "[吐]", "[哈欠]", "[抱抱]", "[怒]", "[疑問]", "[饞嘴]", "[拜拜]", "[思考]",
	              "[汗]", "[困]", "[睡]", "[錢]", "[失望]", "[酷]", "[色]", "[哼]", "[鼓掌]", "[暈]", "[悲傷]", "[抓狂]", 
	              "[黑線]", "[陰險]", "[怒罵]", "[互粉]", "[心]", "[傷心]", "[豬頭]", "[熊貓]", "[兔子]", "[ok]", "[耶]",
	              "[good]", "[NO]", "[贊]", "[來]", "[弱]", "[草泥馬]", "[神馬]", "[囧]", "[浮雲]", "[給力]", "[圍觀]", 
	              "[威武]", "[奧特曼]", "[禮物]", "[鐘]", "[話筒]", "[蠟燭]", "[蛋糕]"];
	
	 exports('face', face);
})